coding/java/junit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2014-04-30 星期三 16:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 例子</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 例子</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b22222;">// </span><span style="color: #b22222;">Caculator.java</span>
<span style="color: #da70d6;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Caculator</span> {
    <span style="color: #da70d6;">public</span> <span style="color: #228b22;">double</span> <span style="color: #0000ff;">add</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">double</span> <span style="color: #228b22;">b</span>){
        <span style="color: #a020f0;">return</span> a+b;
    }
}

<span style="color: #b22222;">// </span><span style="color: #b22222;">CaculatorTest.java</span>
<span style="color: #a020f0;">import static</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #008b8b;">Assert</span>.*;

<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #228b22;">Test</span>;

<span style="color: #da70d6;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">CaculatorTest</span> {

    @Test
    <span style="color: #da70d6;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">test</span>() {
        <span style="color: #228b22;">Caculator</span> <span style="color: #a0522d;">cal</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Caculator</span>();
        assertEquals(<span style="color: #bc8f8f;">4</span>, cal.add(<span style="color: #bc8f8f;">1</span>,<span style="color: #bc8f8f;">2</span>), <span style="color: #bc8f8f;">0</span>);
    }

}

<span style="color: #b22222;">// </span><span style="color: #b22222;">ParameterizedTest.java</span>
<span style="color: #a020f0;">import static</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #008b8b;">Assert</span>.*;

<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">java.util.</span><span style="color: #228b22;">Arrays</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">java.util.</span><span style="color: #228b22;">Collection</span>;

<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #228b22;">Test</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runner.</span><span style="color: #228b22;">RunWith</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runners.</span><span style="color: #228b22;">Parameterized</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runners.</span><span style="color: #008b8b;">Parameterized</span>.<span style="color: #228b22;">Parameters</span>;

@RunWith(value=Parameterized.<span style="color: #a020f0;">class</span>)
<span style="color: #da70d6;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">ParameterizedTest</span> {
    <span style="color: #da70d6;">private</span> <span style="color: #228b22;">double</span> <span style="color: #a0522d;">expected</span>, <span style="color: #a0522d;">valuea</span>, <span style="color: #a0522d;">valueb</span>;

    <span style="color: #da70d6;">public</span> <span style="color: #00008b;">ParameterizedTest</span>(<span style="color: #228b22;">double</span> <span style="color: #a0522d;">expected</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">valuea</span>, <span style="color: #228b22;">double</span> <span style="color: #a0522d;">valueb</span>) {
        <span style="color: #a020f0;">this</span>.expected = expected;
        <span style="color: #a020f0;">this</span>.valuea = valuea;
        <span style="color: #a020f0;">this</span>.valueb = valueb;
    }

    @Parameters
    <span style="color: #da70d6;">public</span> <span style="color: #da70d6;">static</span> <span style="color: #228b22;">Collection</span>&lt;Integer[]&gt; getTestParameters(){
        <span style="color: #a020f0;">return</span> Arrays.asList(<span style="color: #a020f0;">new</span> <span style="color: #228b22;">Integer</span>[][]{
                {<span style="color: #bc8f8f;">3</span>, <span style="color: #bc8f8f;">1</span>, <span style="color: #bc8f8f;">2</span>},
                {<span style="color: #bc8f8f;">4</span>, <span style="color: #bc8f8f;">1</span>, <span style="color: #bc8f8f;">2</span>}
        });
    }

    @Test
    <span style="color: #da70d6;">public</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">sum</span>(){
        <span style="color: #228b22;">Caculator</span> <span style="color: #a0522d;">cal</span> = <span style="color: #a020f0;">new</span> <span style="color: #228b22;">Caculator</span>();
        assertEquals(expected, cal.add(valuea, valueb), <span style="color: #bc8f8f;">0</span>);
    }

}

<span style="color: #b22222;">// </span><span style="color: #b22222;">TestAll.java</span>
<span style="color: #a020f0;">import static</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #008b8b;">Assert</span>.*;

<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.</span><span style="color: #228b22;">Test</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runner.</span><span style="color: #228b22;">RunWith</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runners.</span><span style="color: #228b22;">Suite</span>;
<span style="color: #a020f0;">import</span> <span style="color: #0000cd;">org.junit.runners.</span><span style="color: #008b8b;">Suite</span>.<span style="color: #228b22;">SuiteClasses</span>;

@RunWith(Suite.<span style="color: #a020f0;">class</span>)
@SuiteClasses(<span style="color: #228b22;">value</span>={CaculatorTest.<span style="color: #a020f0;">class</span>, ParameterizedTest.<span style="color: #a020f0;">class</span>})
<span style="color: #da70d6;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">TestAll</span> {

}
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
